app/views/books/_book.html.erb

SELECT "book_genres".* FROM "book_genres" WHERE "book_genres"."book_id" IN (1, 2, 3, 5, 21)
SELECT "genres".* FROM "genres" INNER JOIN "book_genres" ON "genres"."id" = "book_genres"."genre_id" WHERE "book_genres"."book_id" = ?  [["book_id", 3]]
---
<p><strong>Bio: </strong><%= book.description %></p>
<% book.genres.each do |g| %>