app/controllers/books_controller.rb

SELECT "book_genres".* FROM "book_genres" WHERE "book_genres"."book_id" IN (1, 2, 3, 5, 6, 7)
SELECT "books".* FROM "books" INNER JOIN "book_genres" ON "book_genres"."book_id" = "books"."id" INNER JOIN "genres" ON "genres"."id" = "book_genres"."genre_id" WHERE (genres.name='Love story')
SELECT "genres".* FROM "genres" WHERE "genres"."name" = ?  [["name", "non-Friction"]]
SELECT "books".* FROM "books"
SELECT "genres".* FROM "genres" INNER JOIN "book_genres" ON "genres"."id" = "book_genres"."genre_id" WHERE "book_genres"."book_id" = ?  [["book_id", 1]]
---
  def index
    if params[:filter]
      @books=Genre.find_by('name=?',params[:filter]).books
    else
      @books = Book.includes(:genres).search(params[:keyword])

INSERT INTO "books" ("name", "amazon_id", "description", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["amazon_id", ""], ["description", ""], ["author", ""], ["created_at", "2015-12-17 09:48:51.215282"], ["updated_at", "2015-12-17 09:48:51.215282"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "author" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["author", "E L James"], ["updated_at", "2015-12-17 07:47:01.619123"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_book
      @book = Book.find(params[:id])